CircleCI plan matches:
```hcl
Terraform will perform the following actions:

  # aws_route53_record.articles-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "articles-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "articles.alpha.canada.ca"
      + records         = [
          + "ns-1030.awsdns-00.org",
          + "ns-2032.awsdns-62.co.uk",
          + "ns-239.awsdns-29.com",
          + "ns-808.awsdns-37.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```